####################################################################################################################
# Шахнович Дмитрий ИУ7-12Б
#
# Программа для поиска строки с максимальным количеством английских гласных
####################################################################################################################

n = int(input("Введите количество элементов в списке: "))
if n < 1:
    print("Некорректное значение.")

lst = [input(f"{i + 1}-й элемент: ") for i in range(n)]  # Ввод списка

vowel = "aeiouy"  # Гласные
max_vowel = [0, 0]  # Индекс строки с макс. количеством гласных и их кол-во
for ind, string in enumerate(lst):
    vowel_cnt = 0  # Кол-во гласных в строке
    for el in string.lower():
        if el in vowel:
            vowel_cnt += 1
    if max_vowel[1] < vowel_cnt:
        max_vowel[0] = ind
        max_vowel[1] = vowel_cnt

if max_vowel[1] != 0:
    print(f"Строка с максимальным количеством гласных букв:{lst[max_vowel[0]]}")
    print(f"Количество гласных букв:{max_vowel[1]}")
else:
    print("Все строки пустые или не содержат гласных")
